# Lab 2 Rumana Khan and Peter Hughes LC

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///lab2.db3

'Connected: @lab2.db3'

We made the Sailors Table with sid as the primary key. 
We used a double for the age so we can input a decimal number for it.
Then we just print it out to check that the table looks correct.

In [3]:
%%sql drop table if exists Sailors;
create table Sailors(
       sid        int primary key,  -- sailor ID
       sname        varchar,        -- name of Sailor
       rating       int,            --number of rating
       age          double          --age of Sailor
);

insert into Sailors values(22, 'dustin', 7, 45.0);
insert into Sailors values(31, 'lubber', 8, 55.5);
insert into Sailors values(58, 'rusty', 10, 35.0);

 * sqlite:///lab2.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%sql select * from Sailors;

 * sqlite:///lab2.db3
Done.

[(22, 'dustin', 7, 45.0), (31, 'lubber', 8, 55.5), (58, 'rusty', 10, 35.0)]

Similar to the Sailors Table, we made the Boats table in the same manner. The primary key was Bid. 
Then again, we printed it out to make sure the table was correct.

In [5]:
%%sql drop table if exists Boats;
create table Boats(
       bid        int primary key,     -- number of boat
       name          varchar,          -- name of boat
       color         varchar           -- color of boat
);

insert into Boats values(101, 'interlake', 'red');
insert into Boats values(103, 'clipper', 'green');

 * sqlite:///lab2.db3
Done.
Done.
1 rows affected.
1 rows affected.

[]

In [6]:
%sql select * from Boats;

 * sqlite:///lab2.db3
Done.

[(101, 'interlake', 'red'), (103, 'clipper', 'green')]

Now for the Reserves Table, things are a bit different looking because we add foreign keys to this table since it references the two previous tables. 
We make the date the primary key, since the other two are primary keys for the other tables. 
Then we print it out again.

In [7]:
%%sql drop table if exists Reserves;
pragma foreign_keys = ON;
create table Reserves(
       sid            int,                        -- sailor number 
       bid            int,                        -- boat number 
       day        varchar primary key,            -- day of reservation
       foreign key (sid) references Sailors(sid)
       foreign key (bid) references Boats(bid)
);

insert into Reserves values(22, 101, '10/10/96');
insert into Reserves values(58, 103, '11/12/96');

 * sqlite:///lab2.db3
Done.
Done.
Done.
1 rows affected.
1 rows affected.

[]

In [8]:
%sql select * from Reserves;

 * sqlite:///lab2.db3
Done.

[(22, 101, '10/10/96'), (58, 103, '11/12/96')]

For our first query, we only need the two tables: Sailors and Reserves because they have the neccessary information needed. Then we set the condition to when the bid equals to 103 and we make sure that the sids are equal to each other so that the information can be easily found.

In [9]:
%%sql 
SELECT distinct sname
from Sailors, Reserves
WHERE Sailors.sid = Reserves.sid
and Reserves.bid = '103'

 * sqlite:///lab2.db3
Done.

[('rusty',)]

For the second query, we need all three tables. This time, we have to set both the sid and bid in Reserves to their respective tables. We set the boat's color to red and select the sname.

In [10]:
%%sql 
SELECT distinct sname
from Sailors, Reserves, Boats
WHERE Boats.color='red' 
and Sailors.sid = Reserves.sid
and Reserves.bid = Boats.bid

 * sqlite:///lab2.db3
Done.

[('dustin',)]

The third query is very similar to the second one except we have to use OR between the boat color values that we are searching for and we use the paranthesis so it doesn't affect where we set the sid and bid equal to the other sid and bid.

In [11]:
%%sql 
SELECT distinct sname 
from Sailors, Reserves, Boats
WHERE (Boats.color='red' or Boats.color='green')
and Sailors.sid = Reserves.sid 
and Reserves.bid = Boats.bid

 * sqlite:///lab2.db3
Done.

[('dustin',), ('rusty',)]

The fourth query is exactly the same except we change the or to an and and take away the paranthese. This returns no value from the tables.

In [12]:
%%sql 
SELECT distinct sname 
from Sailors, Reserves, Boats
WHERE Boats.color='red' and Boats.color='green' 
and Sailors.sid = Reserves.sid 
and Reserves.bid = Boats.bid

 * sqlite:///lab2.db3
Done.

[]

Finally for the last query, we use the NOT operator to make sure green is never reserved by the sailor, but red is. That ensures that the sailor has only ever reserved the red boat.

In [13]:
%%sql 
SELECT distinct sname 
from Sailors, Reserves, Boats
WHERE Boats.color='red' and not Boats.color='green' 
and Sailors.sid = Reserves.sid 
and Reserves.bid = Boats.bid

 * sqlite:///lab2.db3
Done.

[('dustin',)]